app/controllers/posts_controller.rb

  def edit
    if params[:author_id]
      author = Author.find_by_id(params[:author_id])
      if author.nil?
        redirect_to authors_path, alert: "Author not found."
      else
        @post = author.posts.find_by_id(params[:author_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]